early_models/validation_cases/flapping_wing_3d_ami_validation_basic/backGround/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  7                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
solvers
{

    p
    {
        solver          PBiCGStab;
        preconditioner  DIC;
        tolerance       1e-8;
        relTol          0.1;
	minIter 	2;
    }

    pFinal
    {
        $p;
        relTol          0;
    }

    "pcorr.*"
    {
        $pFinal;
    }

    U
    {

        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-10;
        relTol          0.1;
	minIter 	2;
    }

    UFinal
    {
        $U;
        relTol          0;
    }
}

PIMPLE
{
    momentumPredictor   true;
    nOuterCorrectors    20;
    nCorrectors         4;
    nNonOrthogonalCorrectors 2;

    correctPhi          true; 

    ddtCorr             true;

    residualControl
    {
        U
        {
                tolerance  1e-8;
                relTol      0;
        }
        p
        {
                tolerance  1e-6;
                relTol      0;
        }
     }
}

/*relaxationFactors
{
    fields
    {
    }
    equations
    {
        ".*"           1;
    }
}*/

// ************************************************************************* //
